---
kind: method
id: M:Autodesk.Revit.DB.SymbolicCurveArray.Append(Autodesk.Revit.DB.SymbolicCurve)
source: html/3a344606-8ee1-c68f-ed1e-62c4f150e1fa.htm
---
# Autodesk.Revit.DB.SymbolicCurveArray.Append Method

Add the model curve to the end of the array.

## Syntax (C#)
```csharp
public virtual void Append(
	SymbolicCurve item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.SymbolicCurve`) - The model curve to be added.